@echo off
echo =======================================================
echo           正在清理缓存 (Hexo Clean)...
echo =======================================================
call hexo clean

echo.
echo =======================================================
echo           正在生成静态网页 (Hexo Generate)...
echo =======================================================
call hexo g

echo.
echo =======================================================
echo           正在启动本地服务器 (Hexo Server)...
echo           启动成功后，请打开 http://localhost:4000/about/
echo =======================================================
call hexo s
pause